Revit 2027 API
DuctSizeSettingIterator.MoveNext Method
 Increments the enumerator to the next item.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool MoveNext()
Public Overridable Function MoveNext As Boolean
public:
virtual bool MoveNext()
abstract MoveNext : unit -> bool
override MoveNext : unit -> bool
Return Value
Boolean
 True if there is a next available item in this enumerator. False if the enumerator has completed all available items.
See Also
Reference
DuctSizeSettingIterator Class
Autodesk.Revit.DB.Mechanical Namespace